add diagram to readme
